# --- Packages --- #
# brew "awscli"
brew "bat"  # cat replacement
brew "cmake"
brew "coreutils"  # GNU coreutils (macOS utils are a little different)
brew "diff-so-fancy"  # fancy git diff
brew "direnv"
brew "docker-completion"
brew "docker-compose-completion"
brew "exa", args: ['HEAD']  # ls replacement
brew "fd"  # find replacement
brew "fish"  # shell
brew "fzf"  # fuzzy
brew "ghq"  # repo organization
brew "git"
brew "gnupg"  # GPG tools
brew "hub"  # GitHub tools
brew "ipython"  # better python shell
brew "jq"  # JSON parsing
brew "lazydocker"  # docker term UI
# brew "mysql"
brew "neovim", args: ['HEAD']
brew "node"
brew "openapi-generator"
brew "poetry"
brew "procs"  # ps replacement
brew "python"
brew "reattach-to-user-namespace"  # fix tmux pasteboard mac issues
brew "ripgrep"  # awesome grep
# brew "ruby"
# brew "shellcheck"  # sh linter
brew "shfmt"
brew "starship"  # shell prompt
brew "stow"
brew "tmux"
brew "tokei"
brew "zoxide"  # fast dir nav
brew "zsh"  # backup shell
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# --- Third Party Taps --- #
tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ['HEAD', 'with-jansson']

tap "github/gh"
brew "github/gh/gh"

# tap "aws/tap"
# tap "cloudflare/cloudflare"

# --- Casks --- #
tap "homebrew/cask"
cask "alfred"
cask "brave-browser"
cask "docker"
cask "insomnia"
cask "kitty"
cask "rectangle"
cask "tableplus"
# cask "virtualbox"

# --- Fonts --- #
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
