# --- Packages --- #
brew 'asdf' # tool version manager (node, python, etc)
brew 'bat' # cat replacement
brew 'coreutils' # GNU coreutils (macOS utils are a little different)
brew 'diff-so-fancy'  # fancy git diff
brew 'direnv'
brew 'exa' # ls replacement
brew 'fd' # find replacement
brew 'fish' # shell
brew 'fzf' # fuzzy
brew 'gh' # GitHub CLI
brew 'ghq' # repo organization
brew 'git'
brew 'gnupg' # GPG tools
brew 'hub' # GitHub tools
brew 'ipython' # better python shell
brew 'jq' # JSON parsing
brew 'lazydocker' # docker term UI
brew 'lua-language-server'
brew 'luajit', args: ['HEAD'] # neovim HEAD dep
brew 'neovim', args: ['HEAD']
brew 'node'
# brew 'phoenix' # JS-based OS scripting engine
brew 'pipx'
brew 'procs' # ps replacement
brew 'python'
brew 'ripgrep' # awesome grep
brew 'shellcheck' # used by bashls
brew 'shfmt'
brew 'starship'  # shell prompt
brew 'stow'
brew 'stylua'
brew 'taplo'  # TOML LSP and toolset
brew 'tealdeer'  # Rust tldr pages client
brew 'tokei' # fancy line count
brew 'zoxide' # fast dir nav

# --- Casks --- #
tap 'homebrew/cask'
cask 'alfred'
cask 'amethyst' # tiling window manager
cask 'brave-browser'
cask 'docker'
cask 'hammerspoon'
cask 'insomnia'
# cask 'kitty'
cask 'rectangle'
cask 'tableplus'

tap 'homebrew/cask-versions'
cask 'kitty-nightly'

# --- Fonts --- #
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

# --- Misc --- #
tap 'zero-sh/tap'
brew 'apply-user-defaults'
