# --- Packages --- #
brew 'asdf' # tool version manager (node, python, etc)
brew 'bat' # cat replacement
brew 'coreutils' # GNU coreutils (macOS utils are a little different)
brew 'diff-so-fancy'  # fancy git diff
brew 'direnv'
brew 'eza' # ls replacement
brew 'fd' # find replacement
brew 'fish' # shell
brew 'fzf' # fuzzy
brew 'gh' # GitHub CLI
brew 'git'
brew 'gnupg' # GPG tools
brew 'go'
brew 'ipython' # better python shell
brew 'jq' # JSON parsing
brew 'lazydocker' # docker term UI
brew 'lua-language-server'
brew 'luajit', args: ['HEAD'] # neovim HEAD dep
# brew 'neovim', args: ['HEAD']
brew 'neovim'
brew 'node'
brew 'obsidian'
# brew 'phoenix' # JS-based OS scripting engine
brew 'pipx'
brew 'procs' # ps replacement
brew 'python'
brew 'ripgrep' # awesome grep
brew 'shellcheck' # used by bashls
brew 'shfmt'
brew 'starship'  # shell prompt
brew 'stow'
brew 'stylua'
brew 'taplo'  # TOML LSP and toolset
brew 'tealdeer'  # Rust tldr pages client
# brew 'terraform'
# brew 'terraform-ls'
brew 'tokei' # fancy line count
brew 'zoxide' # fast dir nav

# --- Casks --- #
# cask 'amethyst' # tiling window manager
cask 'brave-browser'
cask 'docker'
# cask 'insomnia'
# cask 'karabiner-elements'
cask 'kitty'
cask 'raycast'
cask 'syncthing'
# cask 'tableplus'

tap 'nikitabobko/tap'
cask 'aerospace' # tiling window manager

# tap 'homebrew/cask-versions'
# cask 'kitty-nightly'

# --- Fonts --- #
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

# --- Misc --- #
tap 'zero-sh/tap'
brew 'apply-user-defaults'
